Revit 2027 API
FabricationPart.StretchAndFit Method
 Stretch the fabrication part from the specified connector and fit to the target routing end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricationPartFitResult StretchAndFit(
	Document document,
	Connector stretchConnector,
	FabricationPartRouteEnd target,
	out ISet<ElementId> newPartIds
)
Public Shared Function StretchAndFit (
	document As Document,
	stretchConnector As Connector,
	target As FabricationPartRouteEnd,
	<OutAttribute> ByRef newPartIds As ISet(Of ElementId)
) As FabricationPartFitResult
public:
static FabricationPartFitResult StretchAndFit(
	Document^ document,
	Connector^ stretchConnector,
	FabricationPartRouteEnd^ target,
	[OutAttribute] ISet<ElementId^>^% newPartIds
)
static member StretchAndFit :
        document : Document *
        stretchConnector : Connector *
        target : FabricationPartRouteEnd *
        newPartIds : ISet<ElementId> byref -> FabricationPartFitResult
Parameters
document Document
 The document in which to perform the stretch and fit.
stretchConnector Connector
 The connector of the fabrication part to be stretched.
target FabricationPartRouteEnd
 The target routing end to align and fit to.
newPartIds ISet<ElementId>
 New fabrication part element identifiers.
Return Value
FabricationPartFitResult
 Returns FabricationPartFitResult::Success if successful.
Exceptions
Exception | Condition
ArgumentException |  Connector does not belong to a fabrication part with a valid fabrication service. -or- Connector is connected. -or- Connector belongs to a fabrication part straight, tap, or hanger. -or- Routing end is valid to route to. -or- stretch target end type must be a supported type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  fabrication part is not connected at one end only. -or- cannot stretch fabrication part to a different service.
Remarks
 Cannot stretch and fit fabrication part straight, tap or hanger.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace